tutorials/heatTransfer/overBuoyantPimpleFoam/movingBox/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   uniform 100000;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    walls
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }
    inlet
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }
    outlet
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }
    hole
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }
    frontAndBack
    {
        type            empty;
    }
    frontAndBack1
    {
        type            empty;
    }
}


// ************************************************************************* //
